#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/mindmelting/iot-neopixel/runs/run-ovp5A4Pgag6FQcKV

Waiting for the plan to start...

Terraform v1.0.3
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_api_gateway_deployment.iot will be created
  + resource "aws_api_gateway_deployment" "iot" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "test"
    }

  # aws_api_gateway_integration.lambda will be created
  + resource "aws_api_gateway_integration" "lambda" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "ANY"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_integration.lambda_root will be created
  + resource "aws_api_gateway_integration" "lambda_root" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "ANY"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_method.proxy will be created
  + resource "aws_api_gateway_method" "proxy" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "ANY"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # aws_api_gateway_method.proxy_root will be created
  + resource "aws_api_gateway_method" "proxy_root" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "ANY"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # aws_api_gateway_resource.proxy will be created
  + resource "aws_api_gateway_resource" "proxy" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{proxy+}"
      + rest_api_id = (known after apply)
    }

  # aws_api_gateway_rest_api.iot will be created
  + resource "aws_api_gateway_rest_api" "iot" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "IoT Application"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = -1
      + name                         = "iot"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)

      + endpoint_configuration {
          + types            = (known after apply)
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # aws_iam_access_key.homebridge_iam_access_key will be created
  + resource "aws_iam_access_key" "homebridge_iam_access_key" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "iot-homebridge-user"
    }

  # aws_iam_policy.iot_shadow_iam_policy will be created
  + resource "aws_iam_policy" "iot_shadow_iam_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "iot-shadow-policy"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role.lambda_iam_role will be created
  + resource "aws_iam_role" "lambda_iam_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "iot-lambda-role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.cloudwatch_attachment will be created
  + resource "aws_iam_role_policy_attachment" "cloudwatch_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "iot-lambda-role"
    }

  # aws_iam_role_policy_attachment.iot_attachment will be created
  + resource "aws_iam_role_policy_attachment" "iot_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "iot-lambda-role"
    }

  # aws_iam_user.homebridge_iam_user will be created
  + resource "aws_iam_user" "homebridge_iam_user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "iot-homebridge-user"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

  # aws_iam_user_policy_attachment.homebridge_attachment will be created
  + resource "aws_iam_user_policy_attachment" "homebridge_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "iot-homebridge-user"
    }

  # aws_iot_certificate.iot_certificate[0] will be created
  + resource "aws_iot_certificate" "iot_certificate" {
      + active          = true
      + arn             = (known after apply)
      + certificate_pem = (sensitive value)
      + id              = (known after apply)
      + private_key     = (sensitive value)
      + public_key      = (sensitive value)
    }

  # aws_iot_policy.iot_policy will be created
  + resource "aws_iot_policy" "iot_policy" {
      + arn                = (known after apply)
      + default_version_id = (known after apply)
      + id                 = (known after apply)
      + name               = "iot-policy"
      + policy             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "iot:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iot_policy_attachment.iot_policy_attachment[0] will be created
  + resource "aws_iot_policy_attachment" "iot_policy_attachment" {
      + id     = (known after apply)
      + policy = "iot-policy"
      + target = (known after apply)
    }

  # aws_iot_thing.iot_thing[0] will be created
  + resource "aws_iot_thing" "iot_thing" {
      + arn               = (known after apply)
      + default_client_id = (known after apply)
      + id                = (known after apply)
      + name              = "neopixel"
      + version           = (known after apply)
    }

  # aws_iot_thing_principal_attachment.iot_thing_attachment[0] will be created
  + resource "aws_iot_thing_principal_attachment" "iot_thing_attachment" {
      + id        = (known after apply)
      + principal = (known after apply)
      + thing     = "neopixel"
    }

  # aws_iot_topic_rule.delta_iot_topic_rule will be created
  + resource "aws_iot_topic_rule" "delta_iot_topic_rule" {
      + arn         = (known after apply)
      + description = "Shadow Delta rule"
      + enabled     = true
      + id          = (known after apply)
      + name        = "iot_delta_rule"
      + sql         = "SELECT state, topic(3) as thing_id FROM '$aws/things/+/shadow/update/delta'"
      + sql_version = "2016-03-23"
      + tags_all    = (known after apply)

      + lambda {
          + function_arn = (known after apply)
        }
    }

  # aws_lambda_function.iot_gh_event will be created
  + resource "aws_lambda_function" "iot_gh_event" {
      + arn                            = (known after apply)
      + filename                       = "./lambda/build/lambda.zip"
      + function_name                  = "iot-google-home-event"
      + handler                        = "main.ghevent"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs14.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "HTryAJcx7gVdId6ZFkPju+DWJSxGpAYPH9bdSf10Wdg="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "IOT_ENDPOINT" = "au4crrz84uqsr.iot.ap-southeast-2.amazonaws.com"
              + "IOT_THINGS"   = "neopixel"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_function.iot_gh_state will be created
  + resource "aws_lambda_function" "iot_gh_state" {
      + arn                            = (known after apply)
      + filename                       = "./lambda/build/lambda.zip"
      + function_name                  = "iot-google-report-state"
      + handler                        = "main.ghstate"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs14.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "HTryAJcx7gVdId6ZFkPju+DWJSxGpAYPH9bdSf10Wdg="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "GOOGLE_CLIENT_EMAIL"   = "report-state@neopixel-home.iam.gserviceaccount.com"
              + "GOOGLE_CLIENT_ID"      = "110898163295150759328"
              + "GOOGLE_PRIVATE_KEY"    = (sensitive)
              + "GOOGLE_PRIVATE_KEY_ID" = "51dcdec8ad19dbfc31630654d028f1c920914bd6"
              + "GOOGLE_PROJECT_ID"     = "neopixel-home"
              + "GOOGLE_X509_CERT_URL"  = "https://www.googleapis.com/robot/v1/metadata/x509/report-state%40neopixel-home.iam.gserviceaccount.com"
              + "IOT_ENDPOINT"          = "au4crrz84uqsr.iot.ap-southeast-2.amazonaws.com"
              + "IOT_THINGS"            = "neopixel"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_layer_version.node_layer will be created
  + resource "aws_lambda_layer_version" "node_layer" {
      + arn                         = (known after apply)
      + compatible_runtimes         = [
          + "nodejs14.x",
        ]
      + created_date                = (known after apply)
      + filename                    = "./lambda/build/layer.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "iot-node-layer"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = "1c5h7PEcFC0lTRTEnOw/r8DWao49oXOfwOC9ZGRNdCQ="
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # aws_lambda_permission.apigw_gh_event will be created
  + resource "aws_lambda_permission" "apigw_gh_event" {
      + action        = "lambda:InvokeFunction"
      + function_name = "iot-google-home-event"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowAPIGatewayInvoke"
    }

  # aws_lambda_permission.iot_core_gh_state will be created
  + resource "aws_lambda_permission" "iot_core_gh_state" {
      + action        = "lambda:InvokeFunction"
      + function_name = "iot-google-report-state"
      + id            = (known after apply)
      + principal     = "iot.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowIoTGatewayInvoke"
    }

Plan: 25 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + base_url                     = (known after apply)
  + iot_homebridge_access_id     = (known after apply)
  + iot_homebridge_access_secret = (sensitive value)
  + iot_pem                      = (sensitive value)
  + iot_private_key              = (sensitive value)
  + iot_public_key               = (sensitive value)

```

</details>

*Pusher: @mindmelting, Action: `pull_request`*